using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*Реализуйте с использованием паттернов проектирования простейшую систему планирования задач.
Должна быть возможность создания списка дел, установки приоритетов,
установки дат выполнения, удаление и изменения дел. Каждому делу можно установить тег.
Список дел можно загружать и сохранять в файл.
Необходимо реализовать возможность поиска конкретного дела.
Критерии поиска: по датам, по тегам, по приоритету и так далее.*/
namespace TaskSchedulingSystem_ChmilRV
{


    class Program
    {


        static void Main(string[] args)
        {



        }
    }
}
